РП/src/Documents/АмортизацияОС/АмортизацияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АмортизацияОС</name>
  <registerRecords>AccumulationRegister.ПрочиеДоходы</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ПартииПрочихРасходов</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.ПартииРасходовНаСебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ПереоценкаОСБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВМеждународномУчете</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоначислениеВНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НачисленнаяАмортизация</name>
    <attributes>
      <name>ОбъектУчета</name>
      <type>
        <types>CatalogRef.ОбъектыЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>НалоговоеНазначение</name>
      <type>
        <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПередаватьРасходыВДругуюОрганизацию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОрганизацияПолучательРасходов</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетПередачиРасходов</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУменьшенияДооценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РП/src/InformationRegisters/УчетнаяПолитикаОрганизаций/УчетнаяПолитикаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитикаОрганизаций</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ПлательщикЕН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчетнаяПолитика</name>
    <type>
      <types>CatalogRef.УчетныеПолитикиОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИННПлательщикаНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерСвидетельстваПлательщикаНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПлательщикНалогаНаПрибыль</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьГруппаПлательщикаЕдиногоНалога</name>
    <comment>для перехода с УТ 3.1</comment>
    <type>
      <types>EnumRef.ГруппыПлательщиковЕдиногоНалога</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьИнформацияОСтатусеПлательщикаНалогов</name>
    <comment>для перехода с УТ 3.1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаИзмененияУчетнойПолитики</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

РП/src/InformationRegisters/СтатусыПлательщиковЕдиногоНалога/СтатусыПлательщиковЕдиногоНалога.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыПлательщиковЕдиногоНалога</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПлательщикЕН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ГруппаПлательщикаЕдиногоНалога</name>
    <type>
      <types>EnumRef.ГруппыПлательщиковЕдиногоНалога</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

РП/src/Enums/ГруппыПлательщиковЕдиногоНалога/ГруппыПлательщиковЕдиногоНалога.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ГруппыПлательщиковЕдиногоНалога</name>
  <comment>Группы плательщиков единого налога</comment>
  <enumValues>
    <name>ПерваяГруппа</name>
  </enumValues>
  <enumValues>
    <name>ВтораяГруппа</name>
  </enumValues>
  <enumValues>
    <name>ТретьяГруппа</name>
  </enumValues>
  <enumValues>
    <name>ТретьяГруппаОсобая</name>
  </enumValues>
  <enumValues>
    <name>ЧетвертаяГруппа</name>
  </enumValues>
  <enumValues>
    <name>ПятаяГруппа</name>
  </enumValues>
  <enumValues>
    <name>ШестаяГруппа</name>
  </enumValues>
</mdclass:Enum>

РП/src/Documents/АмортизацияОС/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы.ПодменюПечать);
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	МенюОтчеты.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюОтчеты);
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	ИнтеграцияС1СДокументооборот.ПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемы

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтчет(Команда)
	
	МенюОтчетыКлиент.ВыполнитьПодключаемуюКомандуОтчет(Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтаФорма, Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	
	Если Не ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтаФорма, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
		ДополнительныеОтчетыИОбработкиКлиент.ПоказатьРезультатВыполненияКоманды(ЭтаФорма, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтаФорма, ИмяЭлемента, РезультатВыполнения);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ОбщегоНазначенияУТ.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект, "Список", "Дата");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДоначислениеВНУ(Команда)

	ПараметрыФормы = Новый Структура("ДоначислениеВНУ", Истина);	
	ОткрытьФорму("Документ.АмортизацияОС.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция СоздатьДоначисленияВНУНаСервере()
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	   "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	   |	УчетнаяПолитикаОрганизацийЕН.Организация КАК Организация
	   |ПОМЕСТИТЬ ОрганизацииКОбработке
	   |ИЗ
	   |	РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизацийЕН
	   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизацийПрибыль
	   |		ПО УчетнаяПолитикаОрганизацийЕН.Организация = УчетнаяПолитикаОрганизацийПрибыль.Организация
	   |			И (УчетнаяПолитикаОрганизацийПрибыль.Период > УчетнаяПолитикаОрганизацийЕН.Период)
	   |			И (УчетнаяПолитикаОрганизацийПрибыль.ПлательщикНалогаНаПрибыль = ИСТИНА)
	   |ГДЕ
	   |	УчетнаяПолитикаОрганизацийЕН.ПлательщикЕН = ИСТИНА
	   |	И УчетнаяПолитикаОрганизацийЕН.УчетнаяПолитика.ГруппаПлательщикаЕдиногоНалога = ЗНАЧЕНИЕ(Перечисление.ГруппыПлательщиковЕдиногоНалога.ТретьяГруппаОсобая)
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	   |	СтатусыПлательщиковЕдиногоНалога.Организация КАК Организация,
	   |	НАЧАЛОПЕРИОДА(СтатусыПлательщиковЕдиногоНалога.Период, МЕСЯЦ) КАК ПериодНачало,
	   |	ВЫБОР
	   |		КОГДА МИНИМУМ(ДОБАВИТЬКДАТЕ(СтатусыПлательщиковЕдиногоНалогаОкончание.Период, СЕКУНДА, -1)) < &МаксимальныйПериод
	   |			ТОГДА МИНИМУМ(ДОБАВИТЬКДАТЕ(СтатусыПлательщиковЕдиногоНалогаОкончание.Период, СЕКУНДА, -1))
	   |		ИНАЧЕ &МаксимальныйПериод
	   |	КОНЕЦ КАК ПериодКонец
	   |ИЗ
	   |	РегистрСведений.СтатусыПлательщиковЕдиногоНалога КАК СтатусыПлательщиковЕдиногоНалога
	   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОрганизацииКОбработке КАК ОрганизацииКОбработке
	   |		ПО СтатусыПлательщиковЕдиногоНалога.Организация = ОрганизацииКОбработке.Организация
	   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПлательщиковЕдиногоНалога КАК СтатусыПлательщиковЕдиногоНалогаОкончание
	   |		ПО (СтатусыПлательщиковЕдиногоНалогаОкончание.Организация = СтатусыПлательщиковЕдиногоНалога.Организация)
	   |			И (СтатусыПлательщиковЕдиногоНалогаОкончание.Период > СтатусыПлательщиковЕдиногоНалога.Период)
	   |			И (СтатусыПлательщиковЕдиногоНалогаОкончание.ГруппаПлательщикаЕдиногоНалога <> ЗНАЧЕНИЕ(Перечисление.ГруппыПлательщиковЕдиногоНалога.ТретьяГруппаОсобая))
	   |ГДЕ
	   |	СтатусыПлательщиковЕдиногоНалога.ГруппаПлательщикаЕдиногоНалога = ЗНАЧЕНИЕ(Перечисление.ГруппыПлательщиковЕдиногоНалога.ТретьяГруппаОсобая)
	   |	И СтатусыПлательщиковЕдиногоНалога.ПлательщикЕН = ИСТИНА
	   |
	   |СГРУППИРОВАТЬ ПО
	   |	СтатусыПлательщиковЕдиногоНалога.Организация,
	   |	НАЧАЛОПЕРИОДА(СтатусыПлательщиковЕдиногоНалога.Период, МЕСЯЦ)
	   |
	   |УПОРЯДОЧИТЬ ПО
	   |	Организация,
	   |	ПериодНачало"; 
	МаксимальныйПериод = '20230731235959';
	Запрос.УстановитьПараметр("МаксимальныйПериод", МаксимальныйПериод);
	
	ТаблицаПериодов = Запрос.Выполнить().Выгрузить();    
	
	Если ТаблицаПериодов.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаПериодов.Организация КАК Организация,
		|	ТаблицаПериодов.ПериодНачало КАК ПериодНачало,
		|	ТаблицаПериодов.ПериодКонец КАК ПериодКонец
		|ПОМЕСТИТЬ ТаблицаПериодов
		|ИЗ
		|	&ТаблицаПериодов КАК ТаблицаПериодов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПериодов.Организация КАК Организация,
		|	НАЧАЛОПЕРИОДА(АмортизацияОС.Дата, МЕСЯЦ) КАК ПериодДокумента
		|ИЗ
		|	ТаблицаПериодов КАК ТаблицаПериодов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АмортизацияОС КАК АмортизацияОС
		|		ПО ТаблицаПериодов.Организация = АмортизацияОС.Организация
		|			И (АмортизацияОС.ДоначислениеВНУ = ИСТИНА)
		|			И (АмортизацияОС.Дата > ТаблицаПериодов.ПериодНачало)
		|			И (АмортизацияОС.Дата <= ТаблицаПериодов.ПериодКонец)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	ПериодДокумента"; 
	
	Запрос.УстановитьПараметр("ТаблицаПериодов", ТаблицаПериодов);
	ВыборкаСуществующиеДокументы = Запрос.Выполнить().Выбрать();
	
	Для каждого СтрокаПериодов Из ТаблицаПериодов Цикл
		ТекущийМесяц = СтрокаПериодов.ПериодНачало;
		ВыборкаСуществующиеДокументы.Сбросить();
		Пока ТекущийМесяц < СтрокаПериодов.ПериодКонец Цикл
			
			СтруктураПоиска = Новый Структура("Организация, ПериодДокумента");
			СтруктураПоиска.Организация = СтрокаПериодов.Организация;
			СтруктураПоиска.ПериодДокумента = ТекущийМесяц;
			Если ВыборкаСуществующиеДокументы.НайтиСледующий(СтруктураПоиска) = Ложь Тогда

				НовыйДокумент = Документы.АмортизацияОС.СоздатьДокумент();
				НовыйДокумент.Организация = СтрокаПериодов.Организация;
				НовыйДокумент.Дата = КонецМесяца(ТекущийМесяц);
				НовыйДокумент.ДоначислениеВНУ = Истина; 
				НовыйДокумент.Ответственный = Пользователи.ТекущийПользователь();
				НовыйДокумент.Комментарий = "#Сформовано автоматично";
				НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
				
			КонецЕсли;
			ТекущийМесяц = НачалоМесяца(ДобавитьМесяц(ТекущийМесяц, 1));
		КонецЦикла;
	КонецЦикла;
	
    Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура КомандаГрупповоеСозданиеДоначислениеВНУ(Команда) 
	
	ТекстВопроса = НСтр("ru='Будут сформированы непроведенные документы 
                         |""Амортизация ОС"" с доначислением в налоговом учете 
                         |для всех организаций за все периоды единого налога 2%. Продолжить?'
                         |;uk='Будуть сформовані непроведені документи
                         |""Амортизація ОЗ"" з донарахуванням у податковому обліку
                         |для всіх організацій за всі періоди єдиного податку 2%. Продовжити?'");
	ПоказатьВопрос(Новый ОписаниеОповещения("КомандаГрупповоеСозданиеДоначислениеВНУЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаГрупповоеСозданиеДоначислениеВНУЗавершение(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Результат = СоздатьДоначисленияВНУНаСервере();
		Если Результат = Ложь Тогда 
			ТекстПредупреждения = НСтр("ru='Нет организаций, которые были плательщиками единого налога 2%, а затем стали плательщиками налога на прибыль. 
                                |Групповое создание доначислений амортизации в налоговом учете не требуется.'
                                |;uk='Немає організацій, які були платниками єдиного податку 2%, а згодом стали платниками податку на прибуток.
                                |Групове створення донарахувань амортизації у податковому обліку не потрібне.'");
			ПоказатьПредупреждение(,ТекстПредупреждения);
		КонецЕсли;
		ЭтаФорма.Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
